wikimedia/smash-pig/Tests/SoapInjector/report_available.xml

<?xml version="1.0" ?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soap:Body>
		<ns1:sendNotification xmlns:ns1="http://notification.services.adyen.com">
			<ns1:notification>
				<live xmlns="http://notification.services.adyen.com">false</live>
				<notificationItems xmlns="http://notification.services.adyen.com">
					<NotificationRequestItem>
						<additionalData xsi:nil="true"/>
						<amount xsi:nil="true"/>
						<eventCode>REPORT_AVAILABLE</eventCode>
						<eventDate>2012-12-14T01:38:57.294+01:00</eventDate>
						<merchantAccountCode>WikimediaCOM</merchantAccountCode>
						<merchantReference xsi:nil="true"/>
						<operations xsi:nil="true"/>
						<originalReference xsi:nil="true"/>
						<paymentMethod xsi:nil="true"/>
						<pspReference>testnotification_REPORT_AVAILABLE</pspReference>
						<reason>https://ca-test.adyen.com/reports/download/MerchantAccount/YMA/REP</reason>
						<success>true</success>
					</NotificationRequestItem>
				</notificationItems>
			</ns1:notification>
		</ns1:sendNotification>
	</soap:Body>
</soap:Envelope>
